xmlsamples/PROD_Pricing/PH-FI-AIS-PH041.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Header/>
   <S:Body>
      <ns0:fee-inquiry-request xmlns:ns0="http://www.westernunion.com/schema/xrsi">
         <channel>
            <type>H2H</type>
            <name>NH</name>
            <version>9500</version>
         </channel>
         <financials>
            <originators_principal_amount>40000</originators_principal_amount>
         </financials>
         <payment_details>
            <recording_country_currency>
               <iso_code>
                  <country_code>PH</country_code>
                  <currency_code>PHP</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>CN</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>PH</country_code>
                  <currency_code>PHP</currency_code>
               </iso_code>
            </originating_country_currency>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
         </payment_details>
         <delivery_services>
            <code>000</code>
         </delivery_services>
         <foreign_remote_system>
            <identifier>WGHHPH0410P</identifier>
            <reference_no>134560-000000011</reference_no>
            <counter_id>PH041ARP329Q</counter_id>
         </foreign_remote_system>
      </ns0:fee-inquiry-request>
   </S:Body>
</S:Envelope>