xmlsamples/PROD_Pricing/TW-FI-AIS-TWN87.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:fee-inquiry-request>
         <channel>
            <type>H2H</type>
            <name>KTB</name>
            <version>9500</version>
         </channel>
         <financials>
            <originators_principal_amount>100000</originators_principal_amount>
         </financials>
         <payment_details>
            <recording_country_currency>
               <iso_code>
                  <country_code>TW</country_code>
                  <currency_code>TWD</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>TH</country_code>
                  <currency_code>THB</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>TW</country_code>
                  <currency_code>TWD</currency_code>
               </iso_code>
            </originating_country_currency>
            <transaction_type>WMN</transaction_type>
         </payment_details>
         <delivery_services>
            <code>500</code>
         </delivery_services>
         <foreign_remote_system>
            <identifier>WGHHTWN870P</identifier>
            <reference_no>1114103836616879</reference_no>
            <counter_id>KTB00000</counter_id>
         </foreign_remote_system>
      </xrsi:fee-inquiry-request>
   </soapenv:Body>
</soapenv:Envelope>